PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p18f66j99.inc
;----- LCDDATA5 Bits -----------------------------------------------------
S40C0            EQU  H'0000'
S41C0            EQU  H'0001'
S42C0            EQU  H'0002'
S43C0            EQU  H'0003'
S44C0            EQU  H'0004'
S45C0            EQU  H'0005'
S46C0            EQU  H'0006'
S47C0            EQU  H'0007'


;----- LCDDATA6 Bits -----------------------------------------------------
S48C0            EQU  H'0000'
S49C0            EQU  H'0001'
S50C0            EQU  H'0002'
S51C0            EQU  H'0003'
S52C0            EQU  H'0004'
S53C0            EQU  H'0005'
S54C0            EQU  H'0006'
S55C0            EQU  H'0007'


;----- LCDDATA7 Bits -----------------------------------------------------
S56C0            EQU  H'0000'
S57C0            EQU  H'0001'
S58C0            EQU  H'0002'
S59C0            EQU  H'0003'
S60C0            EQU  H'0004'
S61C0            EQU  H'0005'
S62C0            EQU  H'0006'
S63C0            EQU  H'0007'


;----- LCDDATA8 Bits -----------------------------------------------------
S00C1            EQU  H'0000'
S01C1            EQU  H'0001'
S02C1            EQU  H'0002'
S03C1            EQU  H'0003'
S04C1            EQU  H'0004'
S05C1            EQU  H'0005'
S06C1            EQU  H'0006'
S07C1            EQU  H'0007'


;----- LCDDATA9 Bits -----------------------------------------------------
S08C1            EQU  H'0000'
S09C1            EQU  H'0001'
S10C1            EQU  H'0002'
S11C1            EQU  H'0003'
S12C1            EQU  H'0004'
S13C1            EQU  H'0005'
S14C1            EQU  H'0006'
S15C1            EQU  H'0007'


;----- LCDDATA10 Bits -----------------------------------------------------
S16C1            EQU  H'0000'
S17C1            EQU  H'0001'
S18C1            EQU  H'0002'
S19C1            EQU  H'0003'
S20C1            EQU  H'0004'
S21C1            EQU  H'0005'
S22C1            EQU  H'0006'
S23C1            EQU  H'0007'


;----- LCDDATA11 Bits -----------------------------------------------------
S24C1            EQU  H'0000'
S25C1            EQU  H'0001'
S26C1            EQU  H'0002'
S27C1            EQU  H'0003'
S28C1            EQU  H'0004'
S29C1            EQU  H'0005'
S30C1            EQU  H'0006'
S31C1            EQU  H'0007'


;----- LCDDATA12 Bits -----------------------------------------------------
S32C1            EQU  H'0000'
S33C1            EQU  H'0001'
S34C1            EQU  H'0002'
S35C1            EQU  H'0003'
S36C1            EQU  H'0004'
S37C1            EQU  H'0005'
S38C1            EQU  H'0006'
S39C1            EQU  H'0007'


;----- LCDDATA13 Bits -----------------------------------------------------
S40C1            EQU  H'0000'
S41C1            EQU  H'0001'
S42C1            EQU  H'0002'
S43C1            EQU  H'0003'
S44C1            EQU  H'0004'
S45C1            EQU  H'0005'
S46C1            EQU  H'0006'
S47C1            EQU  H'0007'


;----- LCDDATA14 Bits -----------------------------------------------------
S48C1            EQU  H'0000'
S49C1            EQU  H'0001'
S50C1            EQU  H'0002'
S51C1            EQU  H'0003'
S52C1            EQU  H'0004'
S53C1            EQU  H'0005'
S54C1            EQU  H'0006'
S55C1            EQU  H'0007'


;----- LCDDATA15 Bits -----------------------------------------------------
S56C1            EQU  H'0000'
S57C1            EQU  H'0001'
S58C1            EQU  H'0002'
S59C1            EQU  H'0003'
S60C1            EQU  H'0004'
S61C1            EQU  H'0005'
S62C1            EQU  H'0006'
S63C1            EQU  H'0007'


;----- LCDDATA16 Bits -----------------------------------------------------
S00C2            EQU  H'0000'
S01C2            EQU  H'0001'
S02C2            EQU  H'0002'
S03C2            EQU  H'0003'
S04C2            EQU  H'0004'
S05C2            EQU  H'0005'
S06C2            EQU  H'0006'
S07C2            EQU  H'0007'


;----- LCDDATA17 Bits -----------------------------------------------------
S08C2            EQU  H'0000'
S09C2            EQU  H'0001'
S10C2            EQU  H'0002'
S11C2            EQU  H'0003'
S12C2            EQU  H'0004'
S13C2            EQU  H'0005'
S14C2            EQU  H'0006'
S15C2            EQU  H'0007'


;----- LCDDATA18 Bits -----------------------------------------------------
S16C2            EQU  H'0000'
S17C2            EQU  H'0001'
S18C2            EQU  H'0002'
S19C2            EQU  H'0003'
S20C2            EQU  H'0004'
S21C2            EQU  H'0005'
S22C2            EQU  H'0006'
S23C2            EQU  H'0007'


;----- LCDDATA19 Bits -----------------------------------------------------
S24C2            EQU  H'0000'
S25C2            EQU  H'0001'
S26C2            EQU  H'0002'
S27C2            EQU  H'0003'
S28C2            EQU  H'0004'
S29C2            EQU  H'0005'
S30C2            EQU  H'0006'
S31C2            EQU  H'0007'


;----- LCDDATA20 Bits -----------------------------------------------------
S32C2            EQU  H'0000'
S33C2            EQU  H'0001'
S34C2            EQU  H'0002'
S35C2            EQU  H'0003'
S36C2            EQU  H'0004'
S37C2            EQU  H'0005'
S38C2            EQU  H'0006'
S39C2            EQU  H'0007'


;----- LCDDATA21 Bits -----------------------------------------------------
S40C2            EQU  H'0000'
S41C2            EQU  H'0001'
S42C2            EQU  H'0002'
S43C2            EQU  H'0003'
S44C2            EQU  H'0004'
S45C2            EQU  H'0005'
S46C2            EQU  H'0006'
S47C2            EQU  H'0007'


;----- LCDDATA22 Bits -----------------------------------------------------
S48C2            EQU  H'0000'
S49C2            EQU  H'0001'
S50C2            EQU  H'0002'
S51C2            EQU  H'0003'
S52C2            EQU  H'0004'
S53C2            EQU  H'0005'
S54C2            EQU  H'0006'
S55C2            EQU  H'0007'


;----- LCDDATA23 Bits -----------------------------------------------------
S56C2            EQU  H'0000'
S57C2            EQU  H'0001'
S58C2            EQU  H'0002'
S59C2            EQU  H'0003'
S60C2            EQU  H'0004'
S61C2            EQU  H'0005'
S62C2            EQU  H'0006'
S63C2            EQU  H'0007'


;----- LCDDATA24 Bits -----------------------------------------------------
S00C3            EQU  H'0000'
S01C3            EQU  H'0001'
S02C3            EQU  H'0002'
S03C3            EQU  H'0003'
S04C3            EQU  H'0004'
S05C3            EQU  H'0005'
S06C3            EQU  H'0006'
S07C3            EQU  H'0007'


